#include <iostream>
#include <cmath>
#include <locale.h>
#include <vector>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    vector <string> q = {"первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое" , "тринадцатое" , "четырнадцатое" , "пятнадцатое" , "шестнадцатое" , "семнадцатое" , "восемнадцатое" , "девятнадцатое" , "двадцатое" , "двадцать первое" , "двадцать второе" , "двадцать третье", "двадцать четвертое" , "двадцать пятое" , "двадцать шестое" , "двадцать седьмое" , "двадцать восьмое" , "двадцать девятое" , "тридцатое", "тридцать первое"};
    vector <string> w = {"января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
    int a, b;
    cout << "Введите целое число А (1 <= A <= 31, день) ";
    cin >> a;
    if (a < 1 || a > 31) {
        cout << "ERROR";
        return 0;
    }
    cout << "Введите целое число B (1 <= B <= 12, месяц) ";
    cin >> b;
    if (b < 1 || b > 12) {
        cout << "ERROR";
        return 0;
    }
    a--;
    b--;
    cout << q[a] << " " << w[b];
}
